app/controllers/applications_controller.rb

  def create
    @application = Application.new(application_params)

    if @application.save
---
INSERT INTO "applications" ("first_name", "last_name", "email", "year", "major", "response_1", "response_2", "commitments", "courses", "resume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"